In [12]:
import numpy as np
import pandas as pd
from sklearn import tree

df = pd.read_csv('./PastHires.csv')
df.head()

,YearsExperience,Employed,PreviousEmployers,LevelOfEducation,Top-tierSchool,Interned,Hired
0,10,Y,4,BS,N,N,Y
1,0,N,0,BS,Y,Y,Y
2,7,N,6,BS,N,N,N
3,2,Y,1,MS,Y,N,Y
4,20,N,2,PhD,Y,N,N

In [13]:
#Now this data has a lot of text and we need to make it into numbers
y_n_map = {'Y':1,'N':0}

education_map ={'BS':0,'MS':1,'PhD':2}

df['Employed'] = df['Employed'].map(y_n_map)

df['LevelOfEducation'] = df['LevelOfEducation'].map(education_map)

df['Top-tierSchool'] = df['Top-tierSchool'].map(y_n_map)
df['Interned'] = df['Interned'].map(y_n_map)
df['Hired'] = df['Hired'].map(y_n_map)

df.head()

,YearsExperience,Employed,PreviousEmployers,LevelOfEducation,Top-tierSchool,Interned,Hired
0,10,1,4,0,0,0,1
1,0,0,0,0,1,1,1
2,7,0,6,0,0,0,0
3,2,1,1,1,1,0,1
4,20,0,2,2,1,0,0

In [14]:
X = df[['YearsExperience','Employed','PreviousEmployers','LevelOfEducation','Top-tierSchool','Interned']]
Y = df [['Hired']]

In [15]:
X.head()

,YearsExperience,Employed,PreviousEmployers,LevelOfEducation,Top-tierSchool,Interned
0,10,1,4,0,0,0
1,0,0,0,0,1,1
2,7,0,6,0,0,0
3,2,1,1,1,1,0
4,20,0,2,2,1,0

In [16]:
Y.head()

   Hired
0      1
1      1
2      0
3      1
4      0

In [17]:
#Lets split it into train and test set
from sklearn.model_selection import train_test_split

X_Train, X_Test, Y_Train, Y_Test = train_test_split(X, Y, test_size=0.3)

In [18]:
from sklearn.ensemble import RandomForestClassifier
model = RandomForestClassifier()
model.fit(X_Train,Y_Train)

/tmp/ipykernel_601183/2307268750.py:3: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  model.fit(X_Train,Y_Train)

RandomForestClassifier()

In [19]:
#Lets find how good was the periction

y_predict = model.predict(X_Test)

In [20]:
from sklearn.metrics import accuracy_score, classification_report, confusion_matrix
accuracy_score(Y_Test, y_predict)

0.5

In [21]:
#Expect 1
model.predict([[10,1,4,0,0,0]])

/home/gaurav/.local/lib/python3.8/site-packages/sklearn/base.py:441: UserWarning: X does not have valid feature names, but RandomForestClassifier was fitted with feature names
  warnings.warn(

array([1])

In [22]:
#Expect 0

model.predict([[7,0,6,0,0,0]])

/home/gaurav/.local/lib/python3.8/site-packages/sklearn/base.py:441: UserWarning: X does not have valid feature names, but RandomForestClassifier was fitted with feature names
  warnings.warn(

array([0])